
import { Shipment, Truck, ShipmentStatus } from './types';

export const SUPPORT_PHONE = '+966538997567';
export const ADMIN_NAME = 'عماد';

export const JEDDAH_DISTRICTS = [
  'الشاطئ', 'أبحر الجنوبية', 'أبحر الشمالية', 'المحمدية', 'المرجان', 'البساتين', 'النزهة', 'النعيم', 'النهضة', 'الزهراء', 'السلامة', 'البوادي', 'الربوة', 'الفيصلية', 'الروضة', 'الخالدية', 'الاندلس', 'الحمراء',
  'الرويس', 'مشرفة', 'العزيزية', 'الرحاب', 'الصفا', 'المروة', 'الثغر', 'الفيحاء', 'النسيم', 'الجامعة', 'الروابي', 'السليمانية', 'الفضيلة', 'الكندرة', 'العمارية', 'البلد', 'البغدادية الشرقية', 'البغدادية الغربية', 'الشرفية', 'الهنداوية', 'الصحيفة', 'السبيل',
  'القريات', 'النزلة اليمانية', 'النزلة الشرقية', 'مدائن الفهد', 'الثعالبة', 'غليل', 'بترومين', 'المحجر', 'الخمرة', 'القرينية', 'السنابل', 'الهدى', 'الأجاويد', 'الأمير فواز الشمالي', 'الأمير فواز الجنوبي', 'العدل', 'المحاني', 'السرورية', 'القوزين',
  'السامر', 'المنار', 'الأجواد', 'النخيل', 'ابرق الرغامة', 'الراية', 'الحرازات', 'الحمدانية', 'الماجد', 'الصالحية', 'الفلاح', 'الرحمانية', 'الاصالة', 'الرياض', 'طيبة', 'الياقوت', 'الزمرد', 'اللؤلؤ', 'الفنار', 'الشراع', 'التيسير', 'بريمان', 'المنار', 'المليساء'
].sort((a, b) => a.localeCompare(b, 'ar'));

export const MOCK_TRUCKS: Truck[] = [];
export const MOCK_SHIPMENTS: Shipment[] = [];
